IDEA StatiCa Open Model
CrossSectionFactory.FillCssSteelRectangularHollow Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fill cross-section of shape rectangular for steel sections
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillCssSteelRectangularHollow(
	CrossSectionParameter cssO,
	double D,
	double B,
	double t,
	double r1,
	double r2,
	double d
)
Public Shared Sub FillCssSteelRectangularHollow (
	cssO As CrossSectionParameter,
	D As Double,
	B As Double,
	t As Double,
	r1 As Double,
	r2 As Double,
	d As Double
)
public:
static void FillCssSteelRectangularHollow(
	CrossSectionParameter^ cssO,
	double D,
	double B,
	double t,
	double r1,
	double r2,
	double d
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
D
Type: System.Double
depth
B
Type: System.Double
width
t
Type: System.Double
thickness
r1
Type: System.Double
inner radius
r2
Type: System.Double
outer radius
d
Type: System.Double
web buckling depth
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace